import { Icon } from '@/modules/core/components/icon';

export default function PublicOffer() {
  return (
    <div className='text-dark'>
      <h1 className='text-2xl font-bold'>Договір публічної оферти</h1>
      <div className='border-b border-gray pb-4' />
      <section className='mt-6'>
        <p>Ласкаво просимо до StyleSync!</p>
        <br />
        <p>
          Договір публічної оферти щодо надання послуг доступу до платформи
          (сервісу) StyleSync на сайті{' '}
          <a
            href='https://stylesync.pro'
            className='text-primary hover:underline'
          >
            stylesync.pro
          </a>
        </p>
        <br />
        <p>
          Документ, положення якого викладені нижче по тексту, є публічною
          пропозицією (офертою) та публічним договором, що регулюється нормами
          Цивільного кодексу України, в тому числі і положеннями статті 633, але
          не виключно нею.
        </p>
        <br />
        <p>
          Приймаючи цю публічну оферту, ви погоджуєтесь з усіма викладеними
          нижче умовами і підтверджуєте, що вам зрозумілі всі її положення та
          укладаєте на цих умовах договір про надання послуг з StyleSync.
        </p>
        <br />
      </section>

      <section className='mt-10'>
        <h2 className='mb-6 text-xl font-semibold'>
          В цьому Договорі, наведеному нижче, терміни вживаються у такому
          значенні:
        </h2>
        <p>
          <span className='font-semibold'>Публічна оферта</span> – пропозиція
          Адміністратора, адресована будь-якій фізичній та/або юридичній особі,
          у відповідності зі статтею 633 Цивільного кодексу України, укласти з
          ним публічний договір про надання послуг доступу до сервісу StyleSync
          на умовах, що викладені у даному Договорі.
        </p>
        <br />
        <p>
          <span className='font-semibold'>Акцепт</span> – повна й безумовна
          згода Користувача на укладення даного Договору на умовах, визначених
          даним Договором.
        </p>
        <br />
        <p>
          <span className='font-semibold'>
            Онлайн сервіс «StyleSync» (надалі Платформа)
          </span>{' '}
          - онлайн платформа у вигляді веб сайту та електронних даних у вигляді
          чисел, букв, символів, зображень та їх комбінацій (включаючи графічну
          інформацію, відеоінформацію тощо), що призначення для збору, обробки,
          розподілу, зберігання, представлення даних про записи, які були
          розміщені на ній Користувачами, та про пропозиції Послуг, які були
          розміщені Профі. Сервіс надає Користувачеві можливість пошуку та
          ознайомлення з пропозиціями Профі та можливість зробити запис на певну
          пропозицію. Онлайн-сервіс є результатом комп’ютерного програмування,
          що належить до програмної продукції.
        </p>
        <br />

        <p>
          <span className='font-semibold'>Веб-сайт</span> – веб-сторінка в
          мережі Інтернет за адресою{' '}
          <a
            href='https://stylesync.pro'
            className='text-primary hover:underline'
          >
            stylesync.pro
          </a>
          . Веб-сайт є результатом комп’ютерного програмування, що належить до
          програмної продукції.
        </p>
        <br />

        <p>
          <span className='font-semibold'>Адміністратор</span> – Фізична
          особа-підриємець(ФОП), створена відповідно до законодавства України –{' '}
          <span className='font-semibold'>
            ФОП Тарасенко Вадим Олександрович
          </span>
          , яка є власником Платформи та надає можливість користуватися нею на
          умовах, які визначені цим Договором.
        </p>
        <br />

        <p>
          <span className='font-semibold'>Користувач</span> – будь-яка юридична
          або дієздатна фізична особа, якій на момент реєстрації на Платформі
          та/або користуванням Платформою без такої реєстрації виповнилося 18
          (вісімнадцять) років, яка прийняла умови цієї Угоди і отримала доступ
          до Платформи.
        </p>
        <br />

        <p>
          <span className='font-semibold'>Профі</span> - користувачі платформи,
          які розміщують на ній пропозиції Послуг та які здійснюють свою
          діяльність на законній підставі з дотриманням усіх вимог законодавства
          України та мають можливість використовувати Платформу за плату, розмір
          якої встановлює Адміністратор, або на безоплатній основі.
        </p>
        <br />

        <p>
          <span className='font-semibold'>Реєстрація</span> - процес створення
          Облікового запису Користувачем після надання їм відповідних даних,
          прийняття Правил і активації Облікового запису.
        </p>
        <br />

        <p>
          <span className='font-semibold'>Обліковий запис</span> - сукупність
          даних, що відносяться до конкретного Користувача, включаючи інформацію
          про його дії на Веб-сайті та інформацію, яка надана Користувачем на
          Веб-сайті.
        </p>
        <br />

        <p>
          <span className='font-semibold'>Користування платформою</span> – це
          надання Адміністратором Користувачеві доступу до Платформи на платній
          або безкоштовній основі, після проходження Користувачем реєстрації в
          порядку встановленому даним Договором.{' '}
        </p>
        <br />

        <p>
          <span className='font-semibold'>Платне користування</span> – надання
          за певну плату, у грошовому виразі, Адміністратором Користувачеві
          послуги в об’ємі передбаченому даним Договором, який Користувач обирає
          самостійно.
        </p>
        <br />

        <p>
          <span className='font-semibold'>Безкоштовне користування</span> –
          надання Адміністратором Користувачеві послуги обмеженого доступу до
          платформи. Обсяг обмеженого доступу визначається Адміністратором на
          власний розсуд та може змінюватись без погодження з Користувачем.
        </p>
        <br />

        <p>
          <span className='font-semibold'>Послуга</span> - розміщений на
          платформі перелік пропозицій Профі щодо надання ними послуг в сфері
          краси, послуг масажу та в інших сферах з надання послуг, не
          заборонених законом.
        </p>
        <br />

        <p>
          <span className='font-semibold'>Вартість користування</span> – платіж,
          розмір якого встановлюється Адміністратором за надання певного об’єму
          послуг для Користувача за доступ до Платформи.
        </p>
        <br />
      </section>

      <section className='mt-10'>
        <h2 className='mb-6 text-xl font-semibold'>1. Загальні положення</h2>
        <p>
          1.1 Договір Користувача (надалі за текстом – Договір) являє собою
          домовленість між Користувачем і Адміністратором щодо надання доступу
          до Платформи.
        </p>
        <br />
        <p>
          1.2 При використанні доступу до Платформи, Користувач незалежно від
          його правового статусу і цивільної дієздатності підпорядковується
          правилам і обмеженням, викладеним в цьому Договорі.
        </p>
        <br />
        <p>
          1.3 Договір з урахуванням всіх змін та доповнень розміщується до
          загального відома на Веб-сайті.
        </p>
        <br />
        <p>
          1.4 Користувач підтверджує, що цілком і повністю ознайомлений і
          згодний з умовами Договору. У разі незгоди Користувача з будь-яким з
          положень цього Договору, Користувач не може користуватися доступом до
          Платформи.
        </p>
        <br />
        <p>
          1.5 Користувач розуміє, що доступ Платформи здійснюється шляхом
          внесення відповідних даних та користування програмними функціями
          Веб-сайту.
        </p>
        <br />
        <p>
          1.6 Користувач надає свою згоду на дотримання умов цього Договору під
          час реєстрації Користувача на Веб-сайті та/або оформленні Послуги на
          Веб-сайті без реєстрації Користувача.
        </p>
        <br />
        <p>
          1.7 Адміністратор може доповнювати або будь-яким іншим чином змінювати
          цю Угоду без попереднього повідомлення Користувача. Користувач цим
          надає свою згоду на внесення змін до Угоди без отримання будь-якого
          спеціального підтвердження з боку Користувача.
        </p>
        <br />
        <p>
          1.8 У разі внесення Адміністратором змін в Договір такі зміни
          вступають в силу з моменту публікації нової редакції Договору на
          Веб-сайті, якщо інший строк набрання чинності змін не визначений
          додатково при його публікації.
        </p>
        <br />
        <p>
          1.9 Адміністратор може в односторонньому порядку припинити та
          заборонити подальше використання Платформи Користувачу, у разі
          використання ним Платформи для здійснення забороненої законом України
          діяльності.
        </p>
        <br />
      </section>

      <section className='mt-10'>
        <h2 className='mb-6 text-xl font-semibold'>2. Предмет Договору</h2>
        <p>
          2.1 Адміністратор зобов’язується надати Користувачу послуги, зміст
          яких полягає в доступі Користувач до Облікового запису Платформи та
          забезпеченні можливості доступу Користувача через його Обліковий запис
          до відповідного функціоналу Платформи, а Користувач – прийняти і
          оплатити послуги на умовах, визначених в цій оферті, або без
          здійснення такої оплати з меншим обсягом функціоналу Платформи для
          Користувача. Вартість користування Платформи визначена на Веб-сайті
          або в рекламних матеріалах.
        </p>
        <br />
        <p>
          2.2 Всі зміни й доповнення до Договору публікуються на Веб-сайті за 30
          календарних днів до провадження таких змін.
        </p>
        <br />
        <p>
          2.3 Всі умови даного Договору є обов’язковими як для Адміністратора,
          так і для Користувача. Користувач зобов’язаний самостійно ознайомитися
          з умовами цього Договору. Адміністратор не зобов’язаний додатково або
          будь-яким іншим способом інформувати Користувача про наявність
          Договору, крім як публікації його на Веб-сайті.
        </p>
        <br />
      </section>

      <section className='mt-10'>
        <h2 className='mb-6 text-xl font-semibold'>
          3. Порядок укладення договору
        </h2>
        <p>
          3.1 Цей Договір укладається на умовах договору приєднання (ст. 634
          Цивільного кодексу України) та вважається укладеним з моменту
          прийняття публічної оферти на невизначений строк і діє до моменту його
          відкликання Адміністратором та/або до повного виконання
          Адміністратором та Користувачем своїх зобов’язань за цим Договором.
        </p>
        <br />
        <p>
          3.2 Приймаючи публічну оферту на укладення такого Договору, Користувач
          підтверджує, що він повністю приймає його умови.
        </p>
        <br />
        <p>
          3.3 Надання послуг користування Платформою починається після
          проходження Користувачем реєстрації на Веб-сайті шляхом акцепту
          (прийняття) умов даного Договору, без його письмового підписання.
          Дійсний Договір має юридичну силу відповідно до ст. 633 ЦК України і є
          рівносильним Договору, підписаному Адміністратором та Користувачем.
          Відповідно, Користувач, який зареєструвався на сайті вважається
          ознайомленим з даним Договором та таким, що погоджується з усіма його
          умовами.
        </p>
        <br />
      </section>

      <section className='mt-10'>
        <h2 className='mb-6 text-xl font-semibold'>
          4. Порядок реєстрації Користувача на Платформі
        </h2>
        <p>
          4.1 Для отримання доступу до Платформи, Користувач здійснює реєстрацію
          через Веб-сайт, в результаті якої створюється унікальний обліковий
          запис Користувача, що забезпечує його доступ до Платформи.
        </p>
        <br />
        <p>
          4.2 При реєстрації Користувач зобов’язаний надати достовірну
          інформацію про себе, шляхом заповнення відповідної реєстраційної
          форми.
        </p>
        <br />
        <p>
          4.3 У разі надання Користувачем недостовірної інформації при
          реєстрації або в подальшому при використанні доступу до
          Онлайн-сервісу, Адміністратор має право призупинити або анулювати дію
          облікового запису (реєстрацію) Користувача без попереднього
          повідомлення або отримання будь-якої згоди Користувача.
        </p>
        <br />
        <p>
          4.4 Адміністратор має право видалити обліковий запис Користувача в
          разі його невикористання Користувачем протягом 12 (дванадцяти)
          календарних місяців.
        </p>
        <br />
        <p>
          4.5 При реєстрації через Веб-сайт Користувач зобов’язаний ввести
          унікальний пароль. При цьому Користувач несе повну відповідальність за
          надійність наданого пароля і захист свого облікового запису.
        </p>
        <br />
        <p>
          4.6 У разі отримання доступу третьою особою до облікового запису
          Користувача, Користувач зобов’язаний негайно повідомити Адміністратора
          для прийняття відповідних заходів за умови, що Користувач може
          підтвердити правомірність приналежності облікового запису конкретному
          такому Користувачеві.
        </p>
        <br />
        <p>
          4.7 Користувач самостійно забезпечує збереження інформації про свої
          паролі та іншої конфіденційної інформації. Адміністратор не несе
          відповідальності за наслідки втрати Користувачем конфіденційної
          інформації про його особисті дані (логін і пароль). Дане положення
          поширюється як на передачу Користувачем інформації про особисті дані
          третім особам добровільно, так і на втрату Користувачем конфіденційної
          інформації про особисті дані поза його волею.
        </p>
        <br />
      </section>

      <section className='mt-10'>
        <h2 className='mb-6 text-xl font-semibold'>5. Права та обов’язки</h2>
        <h3 className='mb-2'>5.1 Користувач має право:</h3>
        <ul className='list-none pl-5'>
          <li className="before:mr-2 before:content-['-']">
            реєструватися на Платформі і в результаті отримати доступ до
            Облікового запису;
          </li>
          <li className="before:mr-2 before:content-['-']">
            редагувати свою інформацію в Обліковому записі, включно з ім’ям,
            прізвищем, імейлом, номером телефону та фотографією;
          </li>
          <li className="before:mr-2 before:content-['-']">
            здійснювати пошук Профі по категоріям, локаціях та інших фільтрах;
          </li>
          <li className="before:mr-2 before:content-['-']">
            здійснювати бронювання для надання послуги/послуг Профі, обравши при
            цьому вид послуги, доступний день та час;
          </li>
          <li className="before:mr-2 before:content-['-']">
            переглядати свої бронювання у вигляді календаря або списку,
            попередньо підтверджені Профі;
          </li>
          <li className="before:mr-2 before:content-['-']">
            скасовувати свої бронювання за 24 години до погодженої години
            бронювання;
          </li>
          <li className="before:mr-2 before:content-['-']">
            отримувати інформацію про послуги та інформацію щодо їх оплати;
          </li>
          <li className="before:mr-2 before:content-['-']">
            реалізовувати інші права, передбачені даним Договором та положеннями
            чинного законодавства України.
          </li>
        </ul>
        <br />
        <h3 className='mb-2'>5.2 Користувач зобов’язаний:</h3>
        <ul className='list-none pl-5'>
          <li className="before:mr-2 before:content-['-']">
            до моменту Акцепту цієї Оферти ознайомитись з усіма її умовами та
            положеннями;
          </li>
          <li className="before:mr-2 before:content-['-']">
            надавати достовірну та правдиву інформацію при реєстрації на
            Платформі та при користуванні нею. Користувач несе повну
            відповідальність за надання неправдивих відомостей, що спричинили
            неможливість належного виконання Адміністратором та/або Профі своїх
            зобов’язань перед Користувачем;
          </li>
        </ul>
        <br />
        <h3 className='mb-2'>5.3. Професіонал має право:</h3>
        <ul className='list-none pl-5'>
          <li className="before:mr-2 before:content-['-']">
            реєструватися на Платформі і в результаті отримати доступ до
            Облікового запису;
          </li>
          <li className="before:mr-2 before:content-['-']">
            додавати інформацію про себе та свою діяльність, включно з фото,
            ім’ям, прізвищем, назвою бренду (якщо такий є), електронною поштою,
            номером телефону, посиланням на соціальні мережі, описом послуг, що
            вони надають, досвідом діяльності та ін.;
          </li>
          <li className="before:mr-2 before:content-['-']">
            редагувати свою інформацію в Обліковому записі, включно з ім’ям,
            прізвищем, імейлом, номером телефону та фотографією;
          </li>
          <li className="before:mr-2 before:content-['-']">
            створювати галерею з фотографіями для надання прикладу своїх робіт;
          </li>
          <li className="before:mr-2 before:content-['-']">
            додати розташування місця надання ними послуг;
          </li>
          <li className="before:mr-2 before:content-['-']">
            підтверджувати бронювання на Платформі, здійснені Користувачем;
          </li>
          <li className="before:mr-2 before:content-['-']">
            реалізовувати інші права, передбачені даним Договором та положеннями
            чинного законодавства України.
          </li>
        </ul>
        <br />
      </section>

      <section className='mt-10'>
        <h2 className='mb-6 text-xl font-semibold'>
          6. Обмеження відповідальності Адміністратора
        </h2>
        <p>
          6.1 Адміністратор не несе відповідальності за будь-яку шкоду життю та
          здоров’ю, будь-які прямі та/або непрямі збитки, матеріальну та/або
          нематеріальну шкоду, зобов’язання чи втрати, понесені в результаті:
          використання або невикористання Користувачем доступу до Платформи;
          розміщення даних, у т.ч. персональних даних, на Веб-сайті; відсутності
          можливості Користувача отримати доступ до Платформи або використанням
          ним такого доступу; ненадання чи неналежного надання Послуг
          Користувачам Профі; будь-яких дій чи бездіяльності Профі; наявності чи
          відсутності будь-яких повноважень, дозволів, ліцензій, погоджень у
          Профі; наявності чи відсутності у Профі спеціального правового статусу
          тощо; несанкціонованого розповсюдження, зміни або знищення інформації
          Користувачів внаслідок використання доступу до Платформи.
        </p>
        <br />
        <p>
          6.2 Адміністратор не приймає і не вирішує скарги, пов’язані з наданням
          або не наданням послуг, а також з неналежним наданням послуг Профі
          Користувачу
        </p>
        <br />
        <p>
          6.3 Адміністратор не несе відповідальності за достовірність фото та
          відео, які розміщені в Обліковому записі Профі.
        </p>
        <br />
        <p>
          6.4 Адміністратор не несе відповідальності перед Користувачем за те,
          щоб Платформа, Веб-сайт відповідали очікуванням Користувача та/або
          доступ до Платформи надавався безперебійно, надійно, без помилок.
          Адміністратор не несе відповідальності за внесення змін, тимчасове або
          повне припинення Платформи, Веб-сайту, або будь-якої їх частини та/або
          доступу до Платформи. Функціонування Платформи та доступу до неї може
          порушуватися діями непереборної сили та інших факторів, запобігання
          яким або подолання яких виходить за межі можливостей Адміністратора.
        </p>
        <br />
        <p />
        <br />
      </section>

      <section className='mt-10'>
        <h2 className='mb-6 text-xl font-semibold'>
          7. Порядок врегулювання спорів
        </h2>
        <p>
          7.1 Усі спори, що виникають за даним Договором або пов`язані із ним,
          вирішуються шляхом переговорів між Адміністратором та Користувачем, а
          також між Адміністратором та Профі.
        </p>
        <br />
        <p>
          7.2 Якщо спір неможливо вирішити шляхом переговорів, він вирішується в
          судовому порядку відповідно до чинного законодавства України за
          місцезнаходженням Адміністратора.
        </p>
        <br />
      </section>

      <section className='mt-10'>
        <h2 className='mb-6 text-xl font-semibold'>8. Заключні положення</h2>
        <p>
          8.1 Умови пропозиції (оферти) щодо укладання даного Договору, так само
          як і умови самого Договору, є однаковими для всіх Користувачів.
        </p>
        <br />
        <p>
          8.2 Пропозиція (оферта) Адміністратора щодо укладання даного Договору
          вважається прийнятою Користувачем в повному обсязі з настання моменту,
          визначеного в п. 3.1 розділу 3 Договору.
        </p>
        <br />
        <p>
          8.3 Укладання цього Договору (акцепт Користувачем оферти
          Адміністратора) вважається беззастережним та повним прийняттям
          Користувачем всіх умов Договору без виключень, в тому числі істотних
          умов.
        </p>
        <br />
        <p>
          8.4 Визнання недійсними, нікчемними або такими, що втратили чинність
          окремих умов даного публічного Договору, не має наслідком визнання
          будь-яких інших умов даного публічного Договору недійсними, нікчемними
          або такими, що втратили чинність.
        </p>
        <br />
        <p>
          8.5 З усіх питань, неврегульованих даним Договором, слід керуватися
          нормами чинного законодавства України.
        </p>
        <br />
      </section>

      <section className='mt-10'>
        <h2 className='mb-6 text-xl font-semibold'>
          9. Реквізити Адміністратора
        </h2>
        <p>
          <a
            href='mailto:mstylesync@gmail.com'
            className='flex w-fit items-center gap-x-2 rounded border border-primary-light px-2 py-1 font-medium text-primary transition hover:bg-primary-light hover:text-accent'
          >
            <Icon name='gmail-logo' width={16} height={16} />
            mstylesync@gmail.com
          </a>
        </p>
        <br />
        <br />
        <br />
      </section>
    </div>
  );
}
