import { Footer } from '@/modules/landing/containers/footer/footer';
import { LandingHeader } from '@/modules/landing/containers/header/landing-header';

export default function PublicOffer() {
  return (
    <div className='flex h-screen flex-col'>
      <LandingHeader />
      <main className='z-10 mt-[120px] flex w-full flex-1 flex-col items-center justify-center px-3 text-center'>
        <section className='mb-5 flex max-w-[700px] flex-col items-start'>
          <p className='mb-3 text-justify'>
            Договір публічної оферти для користувача онлайн-платформою StyleSync
          </p>
          <p className='mb-3 text-justify'>
            Договір публічної оферти щодо надання послуг доступу до платформи
            (сервісу) StyleSync на сайті _______
          </p>
          <p className='text-justify'>
            Документ, положення якого викладені нижче по тексту, є публічною
            пропозицією (офертою) та публічним договором, що регулюється нормами
            Цивільного кодексу України, в тому числі і положеннями статті 633,
            але не виключно нею.
          </p>
          <p className='text-justify'>
            Приймаючи цю публічну оферту, ви погоджуєтесь з усіма викладеними
            нижче умовами і підтверджуєте, що вам зрозумілі всі її положення та
            укладаєте на цих умовах договір про надання послуг з StyleSync.
          </p>
        </section>

        <section className='mb-5 flex max-w-[700px] flex-col items-center'>
          <h1 className='mb-5 text-justify text-2xl font-bold'>
            В цьому Договорі, наведеному нижче, терміни вживаються у такому
            значенні:
          </h1>
          <p className='mb-3 text-justify'>
            Публічна оферта – пропозиція Адміністратора, адресована будь-якій
            фізичній та/або юридичній особі, у відповідності зі статтею 633
            Цивільного кодексу України, укласти з ним публічний договір про
            надання послуг доступу до сервісу StyleSync на умовах, що викладені
            у даному Договорі.
          </p>
          <p className='mb-3 text-justify'>
            Акцепт – повна й безумовна згода Користувача на укладення даного
            Договору на умовах, визначених даним Договором.
          </p>
          <p className='mb-3 text-justify'>
            Онлайн сервіс «StyleSync» (надалі Платформа) - онлайн платформа у
            вигляді веб сайту та електронних даних у вигляді чисел, букв,
            символів, зображень та їх комбінацій (включаючи графічну інформацію,
            відеоінформацію тощо), що призначення для збору, обробки, розподілу,
            зберігання, представлення даних про записи, які були розміщені на
            ній Користувачами, та про пропозиції Послуг, які були розміщені
            Профі. Сервіс надає Користувачеві можливість пошуку та ознайомлення
            з пропозиціями Профі та можливість зробити запис на певну
            пропозицію. Онлайн-сервіс є результатом комп’ютерного програмування,
            що належить до програмної продукції.
          </p>
          <p className='mb-3 text-justify'>
            Веб-сайт – веб-сторінка в мережі Інтернет за адресою ____________
            Веб-сайт є результатом комп’ютерного програмування, що належить до
            програмної продукції.
          </p>
          <p className='mb-3 text-justify'>
            Адміністратор – Фізична особа-підриємець(ФОП), створена відповідно
            до законодавства України – ФОП_________, яка є власником Платформи
            та надає можливість користуватися нею на умовах, які визначені цим
            Договором.
          </p>
          <p className='mb-3 text-justify'>
            Користувач – будь-яка юридична або дієздатна фізична особа, якій на
            момент реєстрації на Платформі та/або користуванням Платформою без
            такої реєстрації виповнилося 18 (вісімнадцять) років, яка прийняла
            умови цієї Угоди і отримала доступ до Платформи.
          </p>
          <p className='mb-3 text-justify'>
            Профі - користувачі платформи, які розміщують на ній пропозиції
            Послуг та які здійснюють свою діяльність на законній підставі з
            дотриманням усіх вимог законодавства України та мають можливість
            використовувати Платформу за плату, розмір якої встановлює
            Адміністратор, або на безоплатній основі.
          </p>
          <p className='mb-3 text-justify'>
            Реєстрація - процес створення Облікового запису Користувачем після
            надання їм відповідних даних, прийняття Правил і активації
            Облікового запису.
          </p>
          <p className='mb-3 text-justify'>
            Обліковий запис - сукупність даних, що відносяться до конкретного
            Користувача, включаючи інформацію про його дії на Веб-сайті та
            інформацію, яка надана Користувачем на Веб-сайті.
          </p>
          <p className='mb-3 text-justify'>
            Користування платформою – це надання Адміністратором Користувачеві
            доступу до Платформи на платній або безкоштовній основі, після
            проходження Користувачем реєстрації в порядку встановленому даним
            Договором.{' '}
          </p>
          <p className='mb-3 text-justify'>
            Платне користування – надання за певну плату, у грошовому виразі,
            Адміністратором Користувачеві послуги в об’ємі передбаченому даним
            Договором, який Користувач обирає самостійно.
          </p>
          <p className='mb-3 text-justify'>
            Безкоштовне користування – надання Адміністратором Користувачеві
            послуги обмеженого доступу до платформи. Обсяг обмеженого доступу
            визначається Адміністратором на власний розсуд та може змінюватись
            без погодження з Користувачем.
          </p>
          <p className='mb-3 text-justify'>
            Послуга - розміщений на платформі перелік пропозицій Профі щодо
            надання ними послуг в сфері краси, послуг масажу та в інших сферах з
            надання послуг, не заборонених законом.
          </p>
          <p className='text-justify'>
            Вартість користування – платіж, розмір якого встановлюється
            Адміністратором за надання певного об’єму послуг для Користувача за
            доступ до Платформи.
          </p>
        </section>

        <section className='mb-5 flex max-w-[700px] flex-col items-start'>
          <h2 className='mb-5 text-2xl font-bold'>1.Загальні положення</h2>
          <p className='mb-3 text-justify'>
            1.1.Договір Користувача (надалі за текстом – Договір) являє собою
            домовленість між Користувачем і Адміністратором щодо надання доступу
            до Платформи.
          </p>
          <p className='mb-3 text-justify'>
            1.2. При використанні доступу до Платформи, Користувач незалежно від
            його правового статусу і цивільної дієздатності підпорядковується
            правилам і обмеженням, викладеним в цьому Договорі.
          </p>
          <p className='mb-3 text-justify'>
            1.3. Договір з урахуванням всіх змін та доповнень розміщується до
            загального відома на Веб-сайті.
          </p>
          <p className='mb-3 text-justify'>
            1.4. Користувач підтверджує, що цілком і повністю ознайомлений і
            згодний з умовами Договору. У разі незгоди Користувача з будь-яким з
            положень цього Договору, Користувач не може користуватися доступом
            до Платформи.
          </p>
          <p className='mb-3 text-justify'>
            1.5. Користувач розуміє, що доступ Платформи здійснюється шляхом
            внесення відповідних даних та користування програмними функціями
            Веб-сайту.
          </p>
          <p className='mb-3 text-justify'>
            1.6. Користувач надає свою згоду на дотримання умов цього Договору
            під час реєстрації Користувача на Веб-сайті та/або оформленні
            Послуги на Веб-сайті без реєстрації Користувача.
          </p>
          <p className='mb-3 text-justify'>
            1.7. Адміністратор може доповнювати або будь-яким іншим чином
            змінювати цю Угоду без попереднього повідомлення Користувача.
            Користувач цим надає свою згоду на внесення змін до Угоди без
            отримання будь-якого спеціального підтвердження з боку Користувача.
          </p>
          <p className='mb-3 text-justify'>
            1.8. У разі внесення Адміністратором змін в Договір такі зміни
            вступають в силу з моменту публікації нової редакції Договору на
            Веб-сайті, якщо інший строк набрання чинності змін не визначений
            додатково при його публікації.
          </p>
          <p className='text-justify'>
            1.9. Адміністратор може в односторонньому порядку припинити та
            заборонити подальше використання Платформи Користувачу, у разі
            використання ним Платформи для здійснення забороненої законом
            України діяльності.
          </p>
        </section>

        <section className='mb-5 flex max-w-[700px] flex-col items-start'>
          <h2 className='mb-5 text-2xl font-bold'>1.Загальні положення</h2>
          <p className='mb-3 text-justify'>
            2.1 Адміністратор зобов’язується надати Користувачу послуги, зміст
            яких полягає в доступі Користувач до Облікового запису Платформи та
            забезпеченні можливості доступу Користувача через його Обліковий
            запис до відповідного функціоналу Платформи, а Користувач – прийняти
            і оплатити послуги на умовах, визначених в цій оферті, або без
            здійснення такої оплати з меншим обсягом функціоналу Платформи для
            Користувача. Вартість користування Платформи визначена на Веб-сайті
            або в рекламних матеріалах.
          </p>
          <p className='mb-3 text-justify'>
            2.2 Всі зміни й доповнення до Договору публікуються на Веб-сайті за
            30 календарних днів до провадження таких змін.
          </p>
          <p className='text-justify'>
            2.3 Всі умови даного Договору є обов’язковими як для Адміністратора,
            так і для Користувача. Користувач зобов’язаний самостійно
            ознайомитися з умовами цього Договору. Адміністратор не зобов’язаний
            додатково або будь-яким іншим способом інформувати Користувача про
            наявність Договору, крім як публікації його на Веб-сайті.
          </p>
        </section>

        <section className='mb-5 flex max-w-[700px] flex-col items-start'>
          <h2 className='mb-5 text-2xl font-bold'>
            3. Порядок укладення договору
          </h2>
          <p className='mb-3 text-justify'>
            3.1 Цей Договір укладається на умовах договору приєднання (ст. 634
            Цивільного кодексу України) та вважається укладеним з моменту
            прийняття публічної оферти на невизначений строк і діє до моменту
            його відкликання Адміністратором та/або до повного виконання
            Адміністратором та Користувачем своїх зобов’язань за цим Договором.
          </p>
          <p className='mb-3 text-justify'>
            3.2 Приймаючи публічну оферту на укладення такого Договору,
            Користувач підтверджує, що він повністю приймає його умови.
          </p>
          <p className='text-justify'>
            3.3 Надання послуг користування Платформою починається після
            проходження Користувачем реєстрації на Веб-сайті шляхом акцепту
            (прийняття) умов даного Договору, без його письмового підписання.
            Дійсний Договір має юридичну силу відповідно до ст. 633 ЦК України і
            є рівносильним Договору, підписаному Адміністратором та
            Користувачем. Відповідно, Користувач, який зареєструвався на сайті
            вважається ознайомленим з даним Договором та таким, що погоджується
            з усіма його умовами.
          </p>
        </section>

        <section className='mb-5 flex max-w-[700px] flex-col items-start'>
          <h2 className='mb-5 text-2xl font-bold'>
            4. Порядок реєстрації Користувача на Платформі
          </h2>
          <p className='mb-3 text-justify'>
            4.1. Для отримання доступу до Платформи, Користувач здійснює
            реєстрацію через Веб-сайт, в результаті якої створюється унікальний
            обліковий запис Користувача, що забезпечує його доступ до Платформи.
          </p>
          <p className='mb-3 text-justify'>
            4.2. При реєстрації Користувач зобов’язаний надати достовірну
            інформацію про себе, шляхом заповнення відповідної реєстраційної
            форми.
          </p>
          <p className='mb-3 text-justify'>
            4.3. У разі надання Користувачем недостовірної інформації при
            реєстрації або в подальшому при використанні доступу до
            Онлайн-сервісу, Адміністратор має право призупинити або анулювати
            дію облікового запису (реєстрацію) Користувача без попереднього
            повідомлення або отримання будь-якої згоди Користувача.
          </p>
          <p className='mb-3 text-justify'>
            4.4. Адміністратор має право видалити обліковий запис Користувача в
            разі його невикористання Користувачем протягом 12 (дванадцяти)
            календарних місяців.
          </p>
          <p className='mb-3 text-justify'>
            4.5. При реєстрації через Веб-сайт Користувач зобов’язаний ввести
            унікальний пароль. При цьому Користувач несе повну відповідальність
            за надійність наданого пароля і захист свого облікового запису.
          </p>
          <p className='mb-3 text-justify'>
            4.6. У разі отримання доступу третьою особою до облікового запису
            Користувача, Користувач зобов’язаний негайно повідомити
            Адміністратора для прийняття відповідних заходів за умови, що
            Користувач може підтвердити правомірність приналежності облікового
            запису конкретному такому Користувачеві.
          </p>
          <p className='text-justify'>
            4.7. Користувач самостійно забезпечує збереження інформації про свої
            паролі та іншої конфіденційної інформації. Адміністратор не несе
            відповідальності за наслідки втрати Користувачем конфіденційної
            інформації про його особисті дані (логін і пароль). Дане положення
            поширюється як на передачу Користувачем інформації про особисті дані
            третім особам добровільно, так і на втрату Користувачем
            конфіденційної інформації про особисті дані поза його волею.
          </p>
        </section>

        <section className='mb-5 flex max-w-[700px] flex-col items-start'>
          <h2 className='mb-4 text-2xl font-bold'>5. Права та обов’язки</h2>

          <h3>5.1. Користувач має право:</h3>
          <ul className='mlist-none pl-5'>
            <li className="text-justify before:mr-2 before:content-['-']">
              реєструватися на Платформі і в результаті отримати доступ до
              Облікового запису;
            </li>
            <li className="text-justify before:mr-2 before:content-['-']">
              редагувати свою інформацію в Обліковому записі, включно з ім’ям,
              прізвищем, імейлом, номером телефону та фотографією;
            </li>
            <li className="text-justify before:mr-2 before:content-['-']">
              здійснювати пошук Профі по категоріям, локаціях та інших фільтрах;
            </li>
            <li className="text-justify before:mr-2 before:content-['-']">
              здійснювати бронювання для надання послуги/послуг Профі, обравши
              при цьому вид послуги, доступний день та час;
            </li>
            <li className="text-justify before:mr-2 before:content-['-']">
              переглядати свої бронювання у вигляді календаря або списку,
              попередньо підтверджені Профі;
            </li>
            <li className="text-justify before:mr-2 before:content-['-']">
              скасовувати свої бронювання за 24 години до погодженої години
              бронювання;
            </li>
            <li className="text-justify before:mr-2 before:content-['-']">
              отримувати інформацію про послуги та інформацію щодо їх оплати;
            </li>
            <li className="text-justify before:mr-2 before:content-['-']">
              реалізовувати інші права, передбачені даним Договором та
              положеннями чинного законодавства України.
            </li>
          </ul>

          <h3>5.2. Користувач зобов’язаний:</h3>
          <ul className='mb-4 list-none pl-5'>
            <li className="text-justify before:mr-2 before:content-['-']">
              до моменту Акцепту цієї Оферти ознайомитись з усіма її умовами та
              положеннями;
            </li>
            <li className="text-justify before:mr-2 before:content-['-']">
              надавати достовірну та правдиву інформацію при реєстрації на
              Платформі та при користуванні нею. Користувач несе повну
              відповідальність за надання неправдивих відомостей, що спричинили
              неможливість належного виконання Адміністратором та/або Профі
              своїх зобов’язань перед Користувачем;
            </li>
          </ul>

          <h3>5.3. Профі має право:</h3>
          <ul className='list-none pl-5'>
            <li className="text-justify before:mr-2 before:content-['-']">
              реєструватися на Платформі і в результаті отримати доступ до
              Облікового запису;
            </li>
            <li className="text-justify before:mr-2 before:content-['-']">
              додавати інформацію про себе та свою діяльність, включно з фото,
              ім’ям, прізвищем, назвою бренду (якщо такий є), електронною
              поштою, номером телефону, посиланням на соціальні мережі, описом
              послуг, що вони надають, досвідом діяльності та ін.;
            </li>
            <li className="text-justify before:mr-2 before:content-['-']">
              редагувати свою інформацію в Обліковому записі, включно з ім’ям,
              прізвищем, імейлом, номером телефону та фотографією;
            </li>
            <li className="text-justify before:mr-2 before:content-['-']">
              створювати галерею з фотографіями для надання прикладу своїх
              робіт;
            </li>
            <li className="text-justify before:mr-2 before:content-['-']">
              додати розташування місця надання ними послуг;
            </li>
            <li className="text-justify before:mr-2 before:content-['-']">
              підтверджувати бронювання на Платформі, здійснені Користувачем;
            </li>
            <li className="text-justify before:mr-2 before:content-['-']">
              реалізовувати інші права, передбачені даним Договором та
              положеннями чинного законодавства України.
            </li>
          </ul>
        </section>

        <section className='mb-5 flex max-w-[700px] flex-col items-start'>
          <h2 className='mb-5 text-2xl font-bold'>
            6. Обмеження відповідальності Адміністратора
          </h2>
          <p className='mb-3 text-justify'>
            6.1. Адміністратор не несе відповідальності за будь-яку шкоду життю
            та здоров’ю, будь-які прямі та/або непрямі збитки, матеріальну
            та/або нематеріальну шкоду, зобов’язання чи втрати, понесені в
            результаті: використання або невикористання Користувачем доступу до
            Платформи; розміщення даних, у т.ч. персональних даних, на
            Веб-сайті; відсутності можливості Користувача отримати доступ до
            Платформи або використанням ним такого доступу; ненадання чи
            неналежного надання Послуг Користувачам Профі; будь-яких дій чи
            бездіяльності Профі; наявності чи відсутності будь-яких повноважень,
            дозволів, ліцензій, погоджень у Профі; наявності чи відсутності у
            Профі спеціального правового статусу тощо; несанкціонованого
            розповсюдження, зміни або знищення інформації Користувачів внаслідок
            використання доступу до Платформи.
          </p>
          <p className='text-justify'>
            6.3. Адміністратор не несе відповідальності перед Користувачем за
            те, щоб Платформа, Веб-сайт відповідали очікуванням Користувача
            та/або доступ до Платформи надавався безперебійно, надійно, без
            помилок. Адміністратор не несе відповідальності за внесення змін,
            тимчасове або повне припинення Платформи, Веб-сайту, або будь-якої
            їх частини та/або доступу до Платформи. Функціонування Платформи та
            доступу до неї може порушуватися діями непереборної сили та інших
            факторів, запобігання яким або подолання яких виходить за межі
            можливостей Адміністратора.
          </p>
        </section>

        <section className='mb-5 flex max-w-[700px] flex-col items-start'>
          <h2 className='mb-5 text-2xl font-bold'>
            7. Порядок врегулювання спорів
          </h2>
          <p className='mb-3 text-justify'>
            7.1. Усі спори, що виникають за даним Договором або пов`язані із
            ним, вирішуються шляхом переговорів між Адміністратором та
            Користувачем, а також між Адміністратором та Профі.
          </p>
          <p className='text-justify'>
            7.2. Якщо спір неможливо вирішити шляхом переговорів, він
            вирішується в судовому порядку відповідно до чинного законодавства
            України за місцезнаходженням Адміністратора.
          </p>
        </section>

        <section className='mb-5 flex max-w-[700px] flex-col items-start'>
          <h2 className='mb-5 text-2xl font-bold'>8. Заключні положення</h2>
          <p className='mb-3 text-justify'>
            8.1.Умови пропозиції (оферти) щодо укладання даного Договору, так
            само як і умови самого Договору, є однаковими для всіх Користувачів.
          </p>
          <p className='mb-3 text-justify'>
            8.2. Пропозиція (оферта) Адміністратора щодо укладання даного
            Договору вважається прийнятою Користувачем в повному обсязі з
            настання моменту, визначеного в п. 3.1 розділу 3 Договору.
          </p>
          <p className='mb-3 text-justify'>
            8.3. Укладання цього Договору (акцепт Користувачем оферти
            Адміністратора) вважається беззастережним та повним прийняттям
            Користувачем всіх умов Договору без виключень, в тому числі істотних
            умов.
          </p>
          <p className='mb-3 text-justify'>
            8.4. Визнання недійсними, нікчемними або такими, що втратили
            чинність окремих умов даного публічного Договору, не має наслідком
            визнання будь-яких інших умов даного публічного Договору недійсними,
            нікчемними або такими, що втратили чинність.
          </p>
          <p className='text-justify'>
            8.5. З усіх питань, неврегульованих даним Договором, слід керуватися
            нормами чинного законодавства України.
          </p>
        </section>

        <section className='mb-10 flex w-full max-w-[700px] flex-col items-start text-left'>
          <h2 className='mb-5 text-2xl font-bold'>
            9. Реквізити Адміністратора
          </h2>
          <p className='text-justify'>Реквізити</p>
        </section>
      </main>
      <Footer />
    </div>
  );
}
