import { Footer } from '@/modules/landing/containers/footer/footer';
import { LandingHeader } from '@/modules/landing/containers/header/landing-header';

export default function PrivacyPolicy() {
  return (
    <div className='relative z-[100] flex h-full flex-col bg-white'>
      <LandingHeader />
      <main className='mt-[120px] flex w-full flex-1 flex-col items-center justify-center px-3 text-center'>
        <section className='flex max-w-[700px] flex-col items-center'>
          <h1 className='mb-4 text-2xl font-bold'>
            ПОЛІТИКА КОНФІДЕНЦІЙНОСТІ ТА ЗАХИСТУ І ОБРОБКИ ПЕРСОНАЛЬНИХ ДАНИХ
          </h1>
          <p className='mb-6 text-justify'>
            Ця Політика конфіденційності та захисту і обробки Персональних Даних
            (надалі – «Політика») розроблена фізичною особою-підприємцем яка діє
            на підставі Виписки з Єдиного державного реєстру юридичних осіб,
            фізичних осіб-підприємців та громадських формувань (номер запису в
            реєстрі: , дата запису: року) Код єдиного державного реєстру
            підприємств та організацій України: (надалі – «Продавець») згідно з
            чинним законодавством України, в тому числі Законом України «Про
            захист персональних даних» No 2297-VI від 01 червня 2010 року, для
            її використання в процесі здійснення підприємницької діяльності і
            встановлює порядок отримання, збору, накопичення, зберігання,
            обробки, використання, забезпечення захисту і розкриття персональних
            даних (надалі – «Дані») Користувачів веб-сайту (надалі – «Сайту»).
          </p>

          <p className='mb-6 text-justify'>
            У цій Політиці встановлено порядок здійснення Продавцем обробки
            персональних даних, види персональних даних, які збираються, цілі та
            принципи використання таких персональних даних, взаємодія Продавця з
            третіми особами, заходи безпеки для захисту персональних даних,
            умови доступу до персональних даних, а також,{' '}
            <span className='font-bold'>контактна інформація</span> для
            Користувача щодо отримання доступу, внесення змін, блокування або
            видалення своїх персональних даних та звернення з будь-якими
            питаннями, які можуть виникнути в останнього щодо захисту
            персональних даних. Третя особа - будь-яка особа, за винятком
            суб’єкта персональних даних, володільця чи розпорядника персональних
            даних та Уповноваженого Верховної Ради України з прав людини, якій
            володільцем чи розпорядником персональних даних здійснюється
            передача персональних даних.
          </p>

          <p className='mb-6 text-justify'>
            Під обробкою Даних розуміється будь-яка дія або сукупність дій з
            Даними, таких як збирання, реєстрація, накопичення, зберігання,
            адаптування, зміна, поновлення, використання і поширення
            (розповсюдження, реалізація, передача), знеособлення, знищення
            персональних даних, у тому числі з використанням інформаційних
            (автоматизованих) систем;
          </p>

          <p className='mb-6 text-justify'>
            Ця Політика охоплює діяльність Продавця як в мережі Інтернет, так і
            поза її межами, включаючи Персональні Дані, які Продавець збирає за
            допомогою різноманітних каналів, таких як веб-сайти, додатки,
            соціальні мережі тощо.{' '}
            <span className='font-bold'>
              Ця Політика не поширюється на сайти, перехід на які здійснюється
              за допомогою гіперпосилань, розміщених на Сайті.
            </span>
          </p>

          <p className='mb-8 text-justify'>
            Володільцем та розпорядником Персональних Даних{' '}
            <span>є фізична особа-підприємець</span> ПІБ (Код ЄДРПОУ: ).
          </p>
        </section>

        <section className='mt-6 max-w-[700px] text-justify'>
          <h2 className='mb-2 text-xl font-medium'>
            ДО СКЛАДУ ПЕРСОНАЛЬНИХ ДАНИХ, ЩО ОБРОБЛЯЮТЬСЯ, МОЖУТЬ ВКЛЮЧАТИСЯ
            ВІДОМОСТІ ПРО:
          </h2>
          <ul className='list-disc pl-5'>
            <li>
              особисту контактну інформацію, яку Користувач надає Продавцю, що
              дозволить зв’язатися з таким Користувачем, – таку як ім’я, адреса
              електронної пошти, дані соціальної мережі або номер телефону;
            </li>
            <li>
              дані для входу в обліковий запис Користувача, в тому числі, номер
              телефону, адреса електронної пошти, логін та пароль, інші Дані,
              необхідні для здійснення обслуговування Користувачів Сайту,
              комунікації з Користувачами в тому числі, коли Користувач
              звертається в службу підтримки Сайту;
            </li>
            <li>
              демографічна інформація, яка описує демографічні та поведінкові
              характеристики Користувача. Наприклад, його дата народження, вік
              чи віковий діапазон, стать, географічне розташування;
            </li>
            <li>
              будь-яка інформація, якою Користувач добровільно ділиться з
              Продавцем про свій досвід використання послуг та інших продуктів,
              залишаючи відгуки, коментарі, звернення в службу підтримки
              клієнтів, скарги, претензії та інші звернення;
            </li>
            <li>
              будь-яка інформація із соціальних мереж, якою Користувач ділиться
              публічно в соціальній мережі, або інформація, яка є частиною
              профілю Користувача в соціальній мережі (наприклад, у Facebook,
              Instagram і т.д). Щоб відмовитися від надання такої інформації в
              соціальній мережі, Користувачу необхідно відвідати веб-сайт
              відповідної соціальної мережі;
            </li>
            <li>
              платіжна інформація, яка необхідна Продавцю для виконання
              замовлень, або яку Користувач використовує для того, щоб здійснити
              оплату послуг на Сайті, наприклад, дані про дебетову або кредитну
              картку (ім’я власника, номер картки, строк дії тощо) або інші
              форми оплати (якщо такі доступні). У будь-якому випадку Продавець
              обробляє платіжну та фінансову інформацію відповідного до чинного
              законодавства, правил і стандартів безпеки;
            </li>
            <li>
              інформація, яку Користувачі надають Продавцю при укладенні
              договорів шляхом акцепту публічної оферти, розміщеної на Сайті
              та/або укладаючи договори про надання додаткових послуг на Сайті.
            </li>
          </ul>
        </section>

        <section className='mt-6 max-w-[700px] text-justify'>
          <p className='text-justify font-bold'>
            Cookie — це невеликі текстові файли, які зберігаються на пристроях
            Користувача під час відвідування веб-сайту{' '}
            <a className='underline' href='#'>
              адреса веб-сайту.
            </a>
          </p>

          <p className='mt-1 text-justify font-bold'>
            . На Сайті можуть бути використані файли cookie, щоб зрозуміти, який
            вміст цікавить Користувача, і запам’ятати його, якщо він знову
            скористається Сайтом. Продавець зберігає файли cookie, щоб
            забезпечити технічно оптимізоване надання послуг з продажу
            (реалізації) товарів та/або користування Сайтом в цілому. Файли
            cookie, які можуть бути використані Продавцем, не можуть завдати
            шкоди пристроям Користувача. Якщо Користувач надає згоду на
            опрацювання персональних даних, це автоматично дозволяє Продавцю
            використовувати файли cookie кожного разу, коли перший користується
            веб-сайтом
            <a className='underline' href='#'>
              адреса веб-сайту.
            </a>
          </p>
        </section>

        <section className='mt-6 max-w-[700px] text-justify'>
          <h2 className='text-center font-semibold'>
            МЕТОЮ ОБРОБКИ ПЕРСОНАЛЬНИХ ДАНИХ, ЩО ОБРОБЛЯЮТЬСЯ, Є:
          </h2>
          <ul className='list-disc pl-5'>
            <li>
              адміністрування Сайту, забезпечення його оновлення і технічної
              підтримки;
            </li>
            <li>
              створення облікового запису Користувача, його реєстрації та/або
              ідентифікації;
            </li>
            <li>
              для зв’язку з Користувачами з метою надання послуг, продажу
              товарів, обробки платежів, проведення розрахункових операцій,
              створення і реалізації програм захисту Користувачів, відправки
              розсилок поштою, електронною поштою, в тому числі з метою
              відправки комерційних пропозицій, повідомлень про акції та інших
              новин Продавця;
            </li>
            <li>
              оцінки та аналізу ринку, продуктів, послуг та сервісів, які
              надаються Продавцем, а також задля покращення якості таких послуг
              та сервісів, формування рейтингів, аналізу активності
              Користувачів, здійснення пошуку по ключовим словам, управління
              трафіком на Сайті, аналізу і прогнозування уподобань, інтересів
              Користувачів;
            </li>
            <li>
              розгляд запитів і скарг, залишених Користувачами з приводу
              використання Сайту;
            </li>
            <li>забезпечення безпеки Сайту і запобігання шахрайству;</li>
            <li>
              перевірка дотримання умов, що регулюють використання Сайту
              (включаючи моніторинг повідомлень, відправлених через службу
              Сайту, якщо Користувачу надана можливість обміну повідомленнями);
            </li>
            <li> безпосереднього надання послуг, які замовляє Користувач;</li>
            <li>
              відправка повідомлень по електронній пошті, які Користувачі можуть
              запросити;
            </li>
            <li>
              будь-яких інших цілей в обсязі, достатньому для якісного надання
              послуг та забезпечення реалізації цивільно-правових, господарських
              та податкових відносин.
            </li>
          </ul>

          <p className='mt-4 text-justify'>
            Крім того, Продавець використовує персональні дані Користувачів в
            маркетингових цілях відповідно до законодавства України. При
            використанні персональних даних Користувачів для прямого маркетингу
            (комерційна розсилка і маркетингові повідомлення про нові продукти,
            товари, послуги та пропозиції), Продавець включає посилання,
            перейшовши за яким{' '}
            <span className='font-bold'>
              Користувач має право відмовитися від підписки на такі повідомлення
              в майбутньому.
            </span>
          </p>
        </section>

        <section className='mt-6 max-w-[700px] text-justify'>
          <h2 className='text-center font-semibold'>
            ЗГІДНО З ЧАСТИНОЮ ДРУГОЮ СТАТТІ 8 ЗАКОНУ УКРАЇНИ «ПРО ЗАХИСТ
            ПЕРСОНАЛЬНИХ ДАНИХ» КОРИСТУВАЧ ЯК СУБ’ЄКТ ПЕРСОНАЛЬНИХ ДАНИХ МАЄ
            ПРАВО:
          </h2>
          <ul className='list-disc pl-5'>
            <li>
              знати про джерела збирання, місцезнаходження своїх персональних
              даних, мету їх обробки, місцезнаходження або місце проживання
              (перебування) володільця чи розпорядника персональних даних або
              дати відповідне доручення щодо отримання цієї інформації
              уповноваженим ним особам, крім випадків, встановлених законом;
            </li>
            <li>
              отримувати інформацію про умови надання доступу до персональних
              даних, зокрема інформацію про третіх осіб, яким передаються його
              персональні дані;
            </li>
            <li> на доступ до своїх персональних даних;</li>
            <li>
              отримувати не пізніш як за тридцять календарних днів з дня
              надходження запиту, крім випадків, передбачених законом, відповідь
              про те, чи обробляються його персональні дані, а також отримувати
              зміст таких персональних даних;
            </li>
            <li>
              пред’являти вмотивовану вимогу володільцю персональних даних із
              запереченням проти обробки своїх персональних даних;
            </li>
            <li>
              пред’являти вмотивовану вимогу щодо зміни або знищення своїх
              персональних даних будь-яким володільцем та розпорядником
              персональних даних, якщо ці дані обробляються незаконно чи є
              недостовірними;
            </li>
            <li>
              на захист своїх персональних даних від незаконної обробки та
              випадкової втрати, знищення, пошкодження у зв’язку з умисним
              приховуванням, ненаданням чи несвоєчасним їх наданням, а також на
              захист від надання відомостей, що є недостовірними чи ганьблять
              честь, гідність та ділову репутацію фізичної особи;
            </li>
            <li>
              звертатися із скаргами на обробку своїх персональних даних до
              Уповноваженого або до суду;
            </li>
            <li>
              застосовувати засоби правового захисту в разі порушення
              законодавства про захист персональних даних;
            </li>
            <li>
              вносити застереження стосовно обмеження права на обробку своїх
              персональних даних під час надання згоди;
            </li>
            <li>відкликати згоду на обробку персональних даних;</li>
            <li>знати механізм автоматичної обробки персональних даних;</li>
            <li>
              {' '}
              на захист від автоматизованого рішення, яке має для нього правові
              наслідки.
            </li>
          </ul>
        </section>

        <section className='mt-6 max-w-[700px] text-justify'>
          <h2 className='text-center font-semibold'>
            ПРОДАВЕЦЬ ОТРИМУЄ ДАНІ ВІД КОРИСТУВАЧА АБО ПРО НЬОГО З НАСТУПНИХ
            ДЖЕРЕЛ:
          </h2>
          <ul className='list-disc pl-5'>
            <li>
              <a className='font-bold underline' href='#'>
                адреса веб-сайту
              </a>
              , яким управляє Продавець під власними доменами/адресами URL та
              сторінки, які Продавець запускає в соціальних мережах, таких як
              Facebook, Instagram, YouTube тощо;
            </li>
            <li>електронна пошта, текстові та інші електронні повідомлення;</li>
            <li>
              електронні реєстраційні форми або аналогічні форми, які Продавець
              збирає за допомогою електронної пошти, або безпосереднього
              користування веб-сайтом{' '}
              <a className='font-bold underline' href='#'>
                адреса веб-сайту
              </a>
              .
            </li>
          </ul>
        </section>

        <section className='mt-6 max-w-[700px] text-justify'>
          <h2 className='text-center font-semibold'>
            ЗАХИСТ ПЕРСОНАЛЬНИХ ДАНИХ.
          </h2>
          <p className='text-justify'>
            Персональні дані, що обробляються, передаються третім особам за
            згодою суб’єкта персональних даних. Передача персональних даних, що
            обробляються, третім особам без згоди суб’єкта персональних даних
            або уповноваженої ним особи дозволяється у випадках, визначених
            законом, і лише (якщо це необхідно) в інтересах національної
            безпеки, економічного добробуту та прав людини.
          </p>
          <p className='mt-4 text-justify'>
            Продавець не несе відповідальності за функціонування серверів,
            постачальників послуги доступу до мережі Інтернет, роботу третіх
            осіб, з вини яких може бути неможливий чи обмежений доступ до Сайту,
            можливий витік інформації з вини третіх осіб, а також за
            розголошення Користувачем своїх персональних даних, в тому числі,
            даних авторизації на Сайті Продавця, в прикладних програмних
            інтерфейсах та застосуваннях.
          </p>
          <p className='mt-4 text-justify'>
            Користувач визнає, що у випадку його недбалого ставлення до безпеки
            і захисту своїх Даних треті особи можуть отримати несанкціонований
            доступ до облікового запису і Даних Користувача. Продавець не несе
            відповідальності за збитки, завдані таким доступом.
          </p>
          <p className='mt-4 text-justify'>
            У зв’язку з чим, Продавець рекомендує переглядати Політику
            конфіденційності, порядок передачі та обробки персональних даних
            кожного веб-сайту перед тим, як передавати будь- які персональні
            дані, за якими можуть ідентифікувати Користувача.
          </p>
        </section>

        <section className='mt-6 max-w-[700px] text-justify'>
          <h2 className='text-center font-semibold'>
            ЗМІНИ В ПОЛІТИЦІ КОНФІДЕНЦІЙНОСТІ ТА ЗАХИСТУ І ОБРОБКИ ПЕРСОНАЛЬНИХ
            ДАНИХ.
          </h2>
          <p>
            До цієї Політики періодично та без попереднього повідомлення
            Користувачів про таке можуть вноситись зміни та доповнення, в тому
            числі, при зміні вимог законодавства. Якщо Продавець змінить спосіб
            обробки Персональних Даних Користувачів, Продавець оновить цю
            Політику. Продавець також залишає за собою право в будь-який час
            вносити зміни до підходів щодо обробки Даних та до цієї Політики.
          </p>
          <p className='mt-4 text-justify'>
            У випадку, якщо які-небуть положення цієї Політики, пункти або їх
            частини, визнаються такими, що суперечать діючому законодавству
            України, або такими, що є недійсними, це не впиває на інші положення
            даної Політки, вони залишаються повністю чинні і продовжують діяти в
            повній мірі і являються дійсними, а будь-яке інше недійсне положення
            або положення, яке не може бути виконаним, без подальших дії Сторін,
            вважається зміненим, виправленим в тій мірі, в якій це необхідно для
            забезпечення його дійсності і можливості виконання.
          </p>
        </section>

        <section className='mb-10 mt-6 max-w-[700px] text-justify'>
          <h2 className='text-center font-semibold'>ЗГОДА КОРИСТУВАЧА.</h2>
          <p>
            Реєструючись, авторизуючись або заповнюючи будь-які форми на
            веб-сайті{' '}
            <a className='font-bold underline' href='#'>
              адреса веб-сайту
            </a>
            ,{' '}
            <span className='font-bold'>
              прикладних програмних інтерфейсах та застосуваннях
            </span>
            , Користувач підтверджує те, що ознайомлений та погоджується з цими
            умовами, зокрема, із метою обробки персональних даних, а також
            правами, наданими Користувачам (суб’єктам персональних даних) згідно
            з чинним законодавством України, та використання персональних даних
            Продавцем, шляхом надання згоди – активував кнопку «Замовити» через
            форму сайту (галочка) та/або проставлення галочки у графі
            «Погоджуюсь з Політикою Конфіденційності та захисту і обробки
            Персональних Даних».
          </p>
          <p className='mt-4 text-justify'>
            Користувач не має право авторизуватися та користуватися послугами на
            веб-сайті{' '}
            <a className='font-bold underline' href='#'>
              адреса веб-сайту
            </a>
            , якщо він не погоджується з даними умовами.
          </p>
          <p className='mt-4 text-justify'>
            Для оновлення, отримання доступу, внесення змін, блокування або
            видалення своїх персональних даних, відкликання згоди на обробку
            персональних даних, яка була надана Продавцю Користувачем, або в
            разі наявності будь-яких зауважень, побажань або претензій щодо
            персональних даних, які обробляються Продавцем, Користувачу
            необхідно надіслати відповідний запит на e-mail:{' '}
            <a className='font-bold underline' href='#'>
              назва
            </a>
          </p>
          <p className='mt-4 text-justify'>
            Разом з тим, робота деяких можливостей Сайту, для яких необхідна
            наявність персональних даних Користувача, може бути припинена з
            моменту їх видалення.
          </p>
          <p className='mt-4 text-justify'>
            Продавець забезпечує застосування всіх відповідних зобов’язань щодо
            дотримання конфіденційності, а також технічних, операційних та
            організаційних заходів безпеки для запобігання несанкціонованого або
            незаконного розголошення або обробки інформації та Даних, їх
            випадкової втрати, знищення або пошкодження.
          </p>
        </section>
      </main>
      <Footer />
    </div>
  );
}
